gauya/bluepill_cube/lib/stm32/src/gadc.cpp
  /* DMA controller clock enable */
  __HAL_RCC_DMA1_CLK_ENABLE();

  /* DMA interrupt init */
  /* DMA1_Channel1_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);

}

#endif //ADCTEST

void adc_cube_start() {
  MX_DMA_Init();
  MX_ADC1_Init();
}

#ifdef __cplusplus
}
#endif

// multichannel, use dma, scan mode, not continuous, one adc

// ---------------------------------------------------------------------------------
gadc::gadc() { //LSE_STARTUP_TIMEOUT
  _status = eADC_NOTSETUP;
  _chs = 0;
  _ha = 0;
  _hd = 0;
  _channel_num = 0;
  _timeout = 1; // ms
  _dmabuf = _outbuf = 0;
  _data_ready = 0;
  _mode = 0;

  _mode = 1; // continuous
}

//#include <stm32f4xx_hal.h>

gadc::gadc(ADC_TypeDef *adc, struct adc_channels *ac) {
  _status = eADC_NOTSETUP;
  _chs = ac;
  _ha = (adc == ADC1)? &hadc1 : (adc == ADC2)? &hadc2: 0;
  if( !_ha ) return;
  _hd = (adc == ADC1)? &hdma_adc1 : (adc == ADC2)? &hdma_adc2: 0;

  _ha->Instance = adc;
  _channel_num = 0;
  _timeout = 1; // ms
  _dmabuf = _outbuf = 0;
  _data_ready = 0;
  _mode = 0;

  setup();
}

gadc::~gadc() {
  stop();
  // nvic off
  HAL_DMA_DeInit(_ha->DMA_Handle);
  HAL_NVIC_DisableIRQ(ADC1_2_IRQn);

  if( _ha->Instance == ADC1) {
    __HAL_RCC_ADC1_CLK_DISABLE();
    __HAL_RCC_DMA1_CLK_DISABLE();
  } else
  if( _ha->Instance == ADC2) {
    __HAL_RCC_ADC2_CLK_DISABLE();
    __HAL_RCC_DMA1_CLK_DISABLE();
  } else {
  }

  if( _dmabuf ) {
    delete[] _dmabuf;
    delete[] _outbuf;
    _dmabuf = _outbuf = 0;
  }
  _status = eADC_NOTSETUP;
}

void gadc::setup() {
  if( _ha && _chs ) {
    this->setup( _ha->Instance, _chs);
  }
}

void gadc::setup(ADC_TypeDef *adc, struct adc_channels *ac) {
  _status = eADC_NOTSETUP;
  _chs = ac;
  _ha = (adc == ADC1)? &hadc1 : (adc == ADC2)? &hadc2: 0;
  if( !_ha ) {
    ERROR_LOG("gadc setup");
    return;
  }

  _ha->Instance = adc;
  _channel_num = 0;
  _timeout = 1; // ms
 
  int channel_cnt = 0;
  for(; (ac+channel_cnt)->ch != -1 ; channel_cnt++);
  
  _ha->Init.ScanConvMode = ENABLE;
  _ha->Init.ExternalTrigConv = ADC_SOFTWARE_START;
  _ha->Init.ContinuousConvMode = DISABLE; //ENABLE;
  _ha->Init.DiscontinuousConvMode = DISABLE;
  _ha->Init.DataAlign = ADC_DATAALIGN_RIGHT;
  _ha->Init.NbrOfConversion = channel_cnt;                   // <> _channel_num

  HUL_ADC_clk_enable(_ha->Instance);

// multi, continues, use dma
#if defined(STM32F4) || defined(STM32F7)
  _ha->Init.EOCSelection = ADC_EOC_SINGLE_CONV;
  _ha->Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV2;
  _ha->Init.Resolution = ADC_RESOLUTION_12B;
  _ha->Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
  if( _mode == eADC_DMA || _mode == eADC_DMAINTERRUPT ) {
    _ha->Init.DMAContinuousRequests = ENABLE;
  } else {
    _ha->Init.DMAContinuousRequests = DISABLE;
  }
#endif //STM32F4

  if (HAL_ADC_Init(_ha) != HAL_OK) {// --> call HAL_ADC_MspInit()
      ERROR_LOG("adc init fail"); //Error_Handler();
  }

  __disable_irq();
  if( HAL_ADCEx_Calibration_Start(_ha) != HAL_OK ) {
      ERROR_LOG("adc cablbration fail"); 
  }
  __enable_irq();

  for(uint8_t i=0; i < _ha->Init.NbrOfConversion; i++) {
    add_channel(_chs+i);
  }

  if( !_dmabuf ) {
    _dmabuf = new uint16_t[channel_num()*2];
    _outbuf = new uint16_t[channel_num()*2];
  }
#if 1  // F1
    __HAL_RCC_DMA1_CLK_ENABLE();

    HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);

// --- ~MspInit()
    
    _hd = (_ha->Instance == ADC1)? &hdma_adc1 : (_ha->Instance == ADC2)? &hdma_adc2 : 0;
    if( !_hd ) {
      ERROR_LOG("");
      return;
    }
    _hd->Instance = DMA1_Channel1;
    _hd->Init.Direction = DMA_PERIPH_TO_MEMORY;
    _hd->Init.PeriphInc = DMA_PINC_DISABLE;
    _hd->Init.MemInc = DMA_MINC_ENABLE;
    _hd->Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    _hd->Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
    _hd->Init.Mode = DMA_CIRCULAR;
    _hd->Init.Priority = DMA_PRIORITY_LOW;
    if (HAL_DMA_Init(_hd) != HAL_OK) {
      ERROR_LOG("dma init fail"); //Error_Handler();
    }

#else  // F4
  __HAL_RCC_DMA2_CLK_ENABLE();
  HAL_NVIC_SetPriority(DMA2_Stream0_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA2_Stream0_IRQn);

  _hd->Instance = DMA2_Stream0;
  _hd->Init.Channel = DMA_CHANNEL_0;
  _hd->Init.Direction = DMA_PERIPH_TO_MEMORY;
  _hd->Init.PeriphInc = DMA_PINC_DISABLE;
  _hd->Init.MemInc = DMA_MINC_ENABLE;
  _hd->Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
  _hd->Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
  _hd->Init.Mode = DMA_CIRCULAR;
  _hd->Init.Priority = DMA_PRIORITY_MEDIUM; //DMA_PRIORITY_LOW;
  _hd->Init.FIFOMode = DMA_FIFOMODE_DISABLE;
  if (HAL_DMA_Init(&hdma_adc1) != HAL_OK)
  {
    ERROR_LOG(""); //Error_Handler();
  }

  hdma_adcp = &hdma_adc1;

#endif  

  if( _ha->Instance == ADC1 ) {
    __HAL_LINKDMA((_ha),DMA_Handle,hdma_adc1);
  } else 
  if( _ha->Instance == ADC2 ) {
    __HAL_LINKDMA((_ha),DMA_Handle,hdma_adc2);
  } else 

  HUL_ADC_nvic(_ha->Instance, 1);

  if(HAL_ADC_Start_DMA(_ha, (uint32_t*)_dmabuf, channel_num()) != HAL_OK) {
    ERROR_LOG("adc start dma nok"); //Error_Handler();
  }

  _status = 0;
}

int gadc::add_channel(uint32_t ch,uint32_t samplerate) {
  ADC_ChannelConfTypeDef sConfig = {0};
  sConfig.Channel = ch;
  sConfig.SamplingTime = samplerate; // default ADC_SAMPLETIME_84CYCLES; 
  sConfig.Rank = ++_channel_num; // 1 ~ ,  

  if (HAL_ADC_ConfigChannel(_ha, &sConfig) != HAL_OK) {
    ERROR_LOG("add adc channel"); //Error_Handler();
  }

  return  _channel_num; // rank is auto increase sequentially
}

int gadc::add_channel(struct adc_channels *ac) {
  ADC_ChannelConfTypeDef sConfig = {0};
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  
  sConfig.Channel = ac->ch;
  sConfig.Rank = ac->rank = _channel_num; // 0~ order by
  sConfig.SamplingTime = ac->sampling; //ADC_SAMPLETIME_3CYCLES;
  
  if (HAL_ADC_ConfigChannel(_ha, &sConfig) != HAL_OK) {
    ERROR_LOG("add adc channel"); //Error_Handler();
  }

  if( ac->port != 0 ) { // not Vrefint, temperture, ..
    // ---> HUL_GPIO_CLK_Enable(ac->port)
    if( IS_GPIO_ALL_INSTANCE(ac->port)) {
      if( IS_GPIO_ALL_INSTANCE(GPIOA) && (ac->port == GPIOA) ) { __HAL_RCC_GPIOA_CLK_ENABLE(); }
      else if( IS_GPIO_ALL_INSTANCE(GPIOB) && (ac->port == GPIOB )) { __HAL_RCC_GPIOB_CLK_ENABLE(); }
      else if( IS_GPIO_ALL_INSTANCE(GPIOC) && (ac->port == GPIOC )) { __HAL_RCC_GPIOC_CLK_ENABLE(); }
      else if( IS_GPIO_ALL_INSTANCE(GPIOD) && (ac->port == GPIOD )) { __HAL_RCC_GPIOD_CLK_ENABLE(); }
      else if( IS_GPIO_ALL_INSTANCE(GPIOE) && (ac->port == GPIOE )) { __HAL_RCC_GPIOE_CLK_ENABLE(); }
//      else if( IS_GPIO_ALL_INSTANCE(GPIOH) && (ac->port == GPIOH )) { __HAL_RCC_GPIOH_CLK_ENABLE(); }
    } else {
      _status |= 4;
      return -1;
    }

    GPIO_InitStruct.Pin = (1 << (ac->pin)); //GPIO_PIN_n;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL; //GPIO_PULLDOWN; //GPIO_NOPULL;
    HAL_GPIO_Init(ac->port, &GPIO_InitStruct);
  }

  return ++_channel_num;
}

int gadc::start() {
  if(HAL_ADC_Start(_ha) != HAL_OK) {
    return 0;
  }
  return -1;
}

int gadc::stop() {
  if(HAL_ADC_Stop(_ha) != HAL_OK) {
    return 0;
  }
  return -1;
}

